app/Controllers/MercadoController.php

SELECT *
FROM `mercados`
---
    public function index(): string
    {
        $mercadoModel = new MercadoModel();
        $mercado = $mercadoModel->findAll();

SELECT *
FROM `mercados`
SELECT *
FROM `mercados`
WHERE `mercados`.`id_mercado` = '1'
SELECT *
FROM `categorias`
---
    public function feria($id_mercado)
    {
        // Crear una instancia del modelo MercadoModel
        $mercadoModel = new MercadoModel();
        $categoriaModel = new CategoriaModel();
        // Buscar el mercado por el id
        $listaMercados = $mercadoModel->findAll();
        $mercado = $mercadoModel->find($id_mercado);

        $productos = $mercadoModel->getProductos($id_mercado);

        foreach ($productos as &$producto) {  // Nota el & para modificar el array original
            $producto['precios'] = $mercadoModel->getProductosAndPrecios($id_mercado, $producto['id_producto']);
        }
        unset($producto); // Limpiamos la referencia

        // dd($productos);

        // dd($productos);
        $categorias = $categoriaModel->findAll();

SELECT *
FROM `mercados`
SELECT *
FROM `mercados`
WHERE `mercados`.`id_mercado` = 1
SELECT *
FROM `categorias`
---
    public function buscar(): string
    {
        // Crear una instancia del modelo MercadoModel
        $search = $this->request->getPost('search');
        $id_mercado = intval($this->request->getPost('id_mercado'));

        $mercadoModel = new MercadoModel();
        $categoriaModel = new CategoriaModel();
        // Buscar el mercado por el id
        $listaMercados = $mercadoModel->findAll();
        $mercado = $mercadoModel->find($id_mercado);
        $productos = $mercadoModel->searchProductos($id_mercado, 10, $search);
        $categorias = $categoriaModel->findAll();

SELECT *
FROM `mercados`
SELECT *
FROM `mercados`
WHERE `mercados`.`id_mercado` = '1'
SELECT *
FROM `categorias`
---
    public function searchByCategoria(): string
    {
        // Crear una instancia del modelo MercadoModel
        $search = $this->request->getGet('id_categoria');
        $id_mercado = $this->request->getGet('id_mercado');

        $mercadoModel = new MercadoModel();
        $categoriaModel = new CategoriaModel();
        // Buscar el mercado por el id
        $listaMercados = $mercadoModel->findAll();
        $mercado = $mercadoModel->find($id_mercado);
        $productos = $mercadoModel->getByCategoria($id_mercado, 10, $search);
        $categorias = $categoriaModel->findAll();