app/Controllers/PrincipalController.php

    public function index(): string
    {
        $mercadoModel = new MercadoModel();
        $listaMercados = $mercadoModel->findAll();
---
SELECT *
FROM `mercados`