app/Controllers/ProductoController.php

    public function feria()
    {
        // Crear una instancia del modelo MercadoModel
        $mercadoModel = new MercadoModel();
        $productoModel = new ProductoModel();
        $categoriaModel = new CategoriaModel();
        // Buscar el mercado por el id
        $listaMercados = $mercadoModel->findAll();
        $productos = $productoModel->getProductos();
        $categorias = $categoriaModel->findAll();
---
SELECT *
FROM `mercados`
SELECT *
FROM `categorias`