app/Models/MercadoModel.php

    public function getProductos(int $mercadoId, int $paginate = 10): array
    {
        // $productos = $this->select('pr.*, mercados.*, p.*, p.nombre as producto, c.*, c.nombre as categoria')
        //     ->join('productos as p', 'p.id_mercado = mercados.id_mercado', 'right')
        //     ->join('categorias as c', 'c.id_categoria = p.id_categoria', 'right')
        //     ->join('precios as pr', 'pr.id_producto = p.id_producto', 'right')
        //     ->where('mercados.id_mercado', $mercadoId)
        //     ->paginate($paginate);
        // return $productos;

        $productos = $this->select('um.*,pr.*,p.nombre as producto,c.*, c.nombre as categoria')
            ->from('productos as p')
            ->join('categorias as c', 'c.id_categoria = p.id_categoria', 'right')
            ->join('precios as pr', 'pr.id_producto = p.id_producto', 'right')
            ->join('unidades_medidas as um', 'um.id_unidad_medida = pr.id_unidad_medida')
            ->where('p.id_mercado', $mercadoId)
            ->paginate($paginate);
---
SELECT COUNT(*) AS `numrows`
FROM `mercados`
JOIN `productos` as `p` ON `p`.`id_mercado` = `mercados`.`id_mercado`
WHERE `p`.`id_mercado` = 1
SELECT `mercados`.`id_mercado`, `p`.`id_producto`, `p`.`nombre` as `producto`
FROM `mercados`
JOIN `productos` as `p` ON `p`.`id_mercado` = `mercados`.`id_mercado`
WHERE `p`.`id_mercado` = 1
 LIMIT 12, 12

    public function searchProductos($mercadoId, int $paginate = 10, $search): array
    {
        // Limpiamos y preparamos el término de búsqueda
        $search = trim(strtolower($search));
        return $this->select('um.*,pr.*, mercados.*,
                                 p.*,
                                 p.nombre as producto,
                                 c.*,
                                 c.nombre as categoria,
                                 CASE
                                    WHEN LOWER(p.nombre) = ' . $this->escape($search) . ' THEN 1
                                    WHEN LOWER(p.nombre) LIKE ' . $this->escape($search . '%') . ' THEN 2
                                    WHEN LOWER(p.nombre) LIKE ' . $this->escape('%' . $search . '%') . ' THEN 3
                                    ELSE 4
                                 END as relevancia')
            ->join('productos as p', 'p.id_mercado = mercados.id_mercado', 'right')
            ->join('categorias as c', 'c.id_categoria = p.id_categoria', 'right')
            ->join('precios as pr', 'pr.id_producto = p.id_producto')
            ->join('unidades_medidas as um', 'um.id_unidad_medida = pr.id_unidad_medida')
            ->groupStart()
            // Búsqueda exacta
            ->like('LOWER(p.nombre)', $search)
            ->orLike('LOWER(c.nombre)', $search)
            ->groupEnd()
            ->orderBy('relevancia', 'ASC')
            ->orderBy('p.nombre', 'ASC')
            ->where('p.id_mercado', $mercadoId)
            ->paginate($paginate);
---
SELECT `precios`.*, `productos`.`nombre` as `producto`, `um`.`medida`, `pr`.`nombre_proporcion`
FROM `precios`
JOIN `productos` ON `productos`.`id_producto` = `precios`.`id_producto`
JOIN `proporciones` `pr` ON `pr`.`id_proporcion` = `precios`.`id_proporcion`
JOIN `unidades_medidas` `um` ON `um`.`id_unidad_medida`  = `precios`.`id_unidad_medida`
WHERE `precios`.`id_producto` = 13
SELECT COUNT(*) AS `numrows`
FROM `mercados`
RIGHT JOIN `productos` as `p` ON `p`.`id_mercado` = `mercados`.`id_mercado`
RIGHT JOIN `categorias` as `c` ON `c`.`id_categoria` = `p`.`id_categoria`
JOIN `precios` as `pr` ON `pr`.`id_producto` = `p`.`id_producto`
JOIN `unidades_medidas` as `um` ON `um`.`id_unidad_medida` = `pr`.`id_unidad_medida`
WHERE   (
LOWER(p.nombre) LIKE '%acelga%' ESCAPE '!'
OR  LOWER(c.nombre) LIKE '%acelga%' ESCAPE '!'
 )
AND `p`.`id_mercado` = 1
SELECT `um`.*, `pr`.*, `mercados`.*, `p`.*, `p`.`nombre` as `producto`, `c`.*, `c`.`nombre` as `categoria`, CASE 
                                    WHEN LOWER(p.nombre) = 'acelga' THEN 1
                                    WHEN LOWER(p.nombre) LIKE 'acelga%' THEN 2
                                    WHEN LOWER(p.nombre) LIKE '%acelga%' THEN 3
                                    ELSE 4
                                 END as relevancia
FROM `mercados`
RIGHT JOIN `productos` as `p` ON `p`.`id_mercado` = `mercados`.`id_mercado`
RIGHT JOIN `categorias` as `c` ON `c`.`id_categoria` = `p`.`id_categoria`
JOIN `precios` as `pr` ON `pr`.`id_producto` = `p`.`id_producto`
JOIN `unidades_medidas` as `um` ON `um`.`id_unidad_medida` = `pr`.`id_unidad_medida`
WHERE   (
LOWER(p.nombre) LIKE '%acelga%' ESCAPE '!'
OR  LOWER(c.nombre) LIKE '%acelga%' ESCAPE '!'
 )
AND `p`.`id_mercado` = 1
ORDER BY `relevancia` ASC, `p`.`nombre` ASC
 LIMIT 10