app/Models/ProductoModel.php

    public function getProductos(int $paginate = 10): array
    {
        $productos = $this->select('pr.*, m.nombre_mercado,productos.*, productos.nombre as producto, c.*, c.nombre as categoria')
            ->join('precios as pr', 'pr.id_producto = productos.id_producto', 'right')
            ->join('categorias as c', 'c.id_categoria = productos.id_categoria', 'right')
            ->join('mercados as m', 'm.id_mercado = productos.id_mercado', 'left')
            // ->join('mercados as mp', 'mp.id_mercado = pr.id_mercado', 'right')
            ->paginate($paginate);
---
SELECT COUNT(*) AS `numrows`
FROM `productos`
RIGHT JOIN `precios` as `pr` ON `pr`.`id_producto` = `productos`.`id_producto`
RIGHT JOIN `categorias` as `c` ON `c`.`id_categoria` = `productos`.`id_categoria`
LEFT JOIN `mercados` as `m` ON `m`.`id_mercado` = `productos`.`id_mercado`
SELECT `pr`.*, `m`.`nombre_mercado`, `productos`.*, `productos`.`nombre` as `producto`, `c`.*, `c`.`nombre` as `categoria`
FROM `productos`
RIGHT JOIN `precios` as `pr` ON `pr`.`id_producto` = `productos`.`id_producto`
RIGHT JOIN `categorias` as `c` ON `c`.`id_categoria` = `productos`.`id_categoria`
LEFT JOIN `mercados` as `m` ON `m`.`id_mercado` = `productos`.`id_mercado`
 LIMIT 10